# Taps
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

# Homebrew packages
brew "git"
brew "zsh"
brew "oh-my-zsh"
brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "vim"
brew "neovim"
brew "tmux"
brew "wget"
brew "curl"
brew "tree"
brew "htop"
brew "jq"
brew "yq"
brew "ripgrep"
brew "fd"
brew "bat"
brew "exa"
brew "fzf"
brew "ag"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "coreutils"
brew "findutils"
brew "moreutils"

# Development tools
brew "node"
brew "npm"
brew "yarn"
brew "nvm"
brew "python"
brew "python3"
brew "pyenv"
brew "ruby"
brew "rbenv"
brew "go"
brew "rust"
brew "java"
brew "maven"
brew "gradle"

# Cloud and DevOps
brew "docker"
brew "docker-compose"
brew "kubectl"
brew "helm"
brew "terraform"
brew "ansible"
brew "awscli"
brew "azure-cli"
brew "gcloud"

# Database tools
brew "postgresql"
brew "mysql"
brew "redis"
brew "sqlite"

# Security tools
brew "gnupg"
brew "openssh"
brew "openssl"

# Media and utilities
brew "ffmpeg"
brew "imagemagick"
brew "pandoc"
brew "mas"

# GUI Applications
cask "visual-studio-code"
cask "sublime-text"
cask "iterm2"
cask "google-chrome"
cask "firefox"
cask "docker"
cask "postman"
cask "slack"
cask "zoom"
cask "discord"
cask "spotify"
cask "vlc"
cask "the-unarchiver"
cask "appcleaner"
cask "rectangle"
cask "alfred"
cask "1password"
cask "dropbox"
cask "google-drive"

# Development GUI apps
cask "github-desktop"
cask "sourcetree"
cask "tableplus"
cask "sequel-pro"
cask "redis-pro"
cask "cyberduck"

# Fonts
cask "font-fira-code"
cask "font-source-code-pro"
cask "font-hack"
cask "font-jetbrains-mono"
cask "font-cascadia-code"

# Mac App Store apps (requires mas)
mas "Xcode", id: 497799835
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541